%%%---------------------------------------
%%%--------------------------------------
%%% @Module  : data_precious_gift
%%% @Author : calvin
%%% @Email : calvinzhong888@gmail.com
%%% @Created : 2012.12.17
%%% @Description : 礼包珍贵开出物品发送传闻
%%%--------------------------------------
-module(data_precious_gift).
-compile(export_all).

get_gift_id() ->
	[532250, 532251, 535543, 534091, 534129].
get_good_id() ->
	[112104, 112105, 601701, 523505, 621101, 523502, 523503, 523504, 112104, 121005, 121006, 112231, 111030, 112104, 112105].

