
%%%---------------------------------------
%%% @Module  : data_guild_auto
%%% @Author  : xhg
%%% @Email   : xuhuguang@gmail.com
%%% @Created : 2014-04-29 16:16:31
%%% @Description:  自动生成
%%%---------------------------------------
-module(data_guild_auto).
-compile(export_all).

%% 日福利
%% @param 等级 职位
%% {帮派等级,[帮主日福利,副帮主日福利,长老日福利,堂主日福利,帮主日福利]}
get_paid_daily(Level, Position) ->
    PaidDailyInfo = 
        [
{1, [3000, 2000, 1500, 1000, 500]},{2, [6000, 4000, 3000, 2000, 1000]},{3, [9000, 6000, 4500, 3000, 1500]},{4, [12000, 8000, 6000, 4000, 2000]},{5, [15000, 10000, 7500, 5000, 2500]},{6, [18000, 12000, 9000, 6000, 3000]},{7, [21000, 14000, 10500, 7000, 3500]},{8, [24000, 16000, 12000, 8000, 4000]},{9, [27000, 18000, 13500, 9000, 4500]},{10, [30000, 20000, 15000, 10000, 5000]},{11, [33000, 22000, 16500, 11000, 5500]},{12, [36000, 24000, 18000, 12000, 6000]},{13, [39000, 26000, 19500, 13000, 6500]},{14, [42000, 28000, 21000, 14000, 7000]},{15, [45000, 30000, 22500, 15000, 7500]}
	    	],
	    	{value, {_, PaidDaily}}  = lists:keysearch(Level, 1, PaidDailyInfo),
    lists:nth(Position, PaidDaily).

%% 级别信息
%% @param 等级
%% {帮派等级, 成员数量上限, 帮派建设上限, 每日建设}
get_level_info(Level) ->
    LevelInfo = 
        [    	
{1,15,1800,200},{2,20,3600,400},{3,25,9000,800},{4,30,32400,2400},{5,35,50400,3200},{6,40,72000,4000},{7,45,113400,7200},{8,50,216000,8400},{9,55,291600,9600},{10,60,378000,12400},{11,65,576000,16000},{12,70,874000,18600},{13,75,1272000,20200},{14,80,1770000,22800},{15,85,3368000,28400}
	    	],
    {value, {_, MemberCapcity, ContributionThreshold, ContributionDaily}}  = lists:keysearch(Level, 1, LevelInfo),
    [MemberCapcity, ContributionThreshold, ContributionDaily].
%% 帮派建筑基本信息
%% @param 类别 等级
%% {建筑编号 建筑类型 等级 升级操作权限 升级建设度 升级铜币 升级元宝 数量 建筑名称 前提建筑 下级建筑编号 当前及升级效果 建筑描述文字}
get_build_base_info(2, 0) -> {100201,2, 0,1,100,11000,0,0,"帮派神炉","100101","100202","提升装备强化成功率3%","升级能够提高帮派成员强化物品的几率。"};
get_build_base_info(2, 1) -> {100202,2, 1,1,600,68000,0,3,"帮派神炉","100102","100203","提升装备强化成功率6%","升级能够提高帮派成员强化物品的几率。"};
get_build_base_info(2, 2) -> {100203,2, 2,1,1500,182000,0,6,"帮派神炉","100103","100204","提升装备强化成功率9%","升级能够提高帮派成员强化物品的几率。"};
get_build_base_info(2, 3) -> {100204,2, 3,1,5400,612000,0,9,"帮派神炉","100104","100205","提升装备强化成功率15%","升级能够提高帮派成员强化物品的几率。"};
get_build_base_info(2, 4) -> {100205,2, 4,1,8400,968000,0,15,"帮派神炉","100105","100206","提升装备强化成功率21%","升级能够提高帮派成员强化物品的几率。"};
get_build_base_info(2, 5) -> {100206,2, 5,1,12000,1400000,0,21,"帮派神炉","100106","100207","提升装备强化成功率27%","升级能够提高帮派成员强化物品的几率。"};
get_build_base_info(2, 6) -> {100207,2, 6,1,18900,2226000,0,27,"帮派神炉","100107","100208","提升装备强化成功率33%","升级能够提高帮派成员强化物品的几率。"};
get_build_base_info(2, 7) -> {100208,2, 7,1,36000,4048000,0,33,"帮派神炉","100108","100209","提升装备强化成功率39%","升级能够提高帮派成员强化物品的几率。"};
get_build_base_info(2, 8) -> {100209,2, 8,1,48600,5436000,0,39,"帮派神炉","100109","100210","提升装备强化成功率45%","升级能够提高帮派成员强化物品的几率。"};
get_build_base_info(2, 9) -> {100210,2, 9,1,63000,7020000,0,45,"帮派神炉","100110","100211","提升装备强化成功率50%","升级能够提高帮派成员强化物品的几率。"};
get_build_base_info(2, 10) -> {100211,2, 10,1,77400,10040000,0,50,"帮派神炉","100111","100212","提升装备强化成功率50%","升级能够提高帮派成员强化物品的几率。"};
get_build_base_info(2, 11) -> {100212,2, 11,1,91800,20450000,0,50,"帮派神炉","100112","100213","提升装备强化成功率50%","升级能够提高帮派成员强化物品的几率。"};
get_build_base_info(2, 12) -> {100213,2, 12,1,106200,42472000,0,50,"帮派神炉","100113","100214","提升装备强化成功率50%","升级能够提高帮派成员强化物品的几率。"};
get_build_base_info(2, 13) -> {100214,2, 13,1,120600,74656000,0,50,"帮派神炉","100114","100215","提升装备强化成功率50%","升级能够提高帮派成员强化物品的几率。"};
get_build_base_info(2, 14) -> {100215,2, 14,1,135000,107940000,0,50,"帮派神炉","100115","100216","提升装备强化成功率50%","升级能够提高帮派成员强化物品的几率。"};
get_build_base_info(2, 15) -> {100216,2, 15,1,0,0,0,50,"帮派神炉","0","0","该建筑已经是最高等级。","升级能够提高帮派成员强化物品的几率。"};
get_build_base_info(3, 0) -> {100301,3, 0,1,100,11000,0,0,"帮派商店","100101","100302","可以购买帮派商店1级物品","升级后帮派成员玩家可以在帮派商店购买相应等级的物品。"};
get_build_base_info(3, 1) -> {100302,3, 1,1,600,68000,0,1,"帮派商店","100102","100303","可以购买帮派商店2级物品","升级后帮派成员玩家可以在帮派商店购买相应等级的物品。"};
get_build_base_info(3, 2) -> {100303,3, 2,1,1500,182000,0,2,"帮派商店","100103","100304","可以购买帮派商店3级物品","升级后帮派成员玩家可以在帮派商店购买相应等级的物品。"};
get_build_base_info(3, 3) -> {100304,3, 3,1,5400,612000,0,3,"帮派商店","100104","100305","可以购买帮派商店4级物品","升级后帮派成员玩家可以在帮派商店购买相应等级的物品。"};
get_build_base_info(3, 4) -> {100305,3, 4,1,8400,968000,0,4,"帮派商店","100105","100306","可以购买帮派商店5级物品","升级后帮派成员玩家可以在帮派商店购买相应等级的物品。"};
get_build_base_info(3, 5) -> {100306,3, 5,1,12000,1400000,0,5,"帮派商店","100106","100307","可以购买帮派商店6级物品","升级后帮派成员玩家可以在帮派商店购买相应等级的物品。"};
get_build_base_info(3, 6) -> {100307,3, 6,1,18900,2226000,0,6,"帮派商店","100107","100308","可以购买帮派商店7级物品","升级后帮派成员玩家可以在帮派商店购买相应等级的物品。"};
get_build_base_info(3, 7) -> {100308,3, 7,1,36000,4048000,0,7,"帮派商店","100108","100309","可以购买帮派商店8级物品","升级后帮派成员玩家可以在帮派商店购买相应等级的物品。"};
get_build_base_info(3, 8) -> {100309,3, 8,1,48600,5436000,0,8,"帮派商店","100109","100310","可以购买帮派商店9级物品","升级后帮派成员玩家可以在帮派商店购买相应等级的物品。"};
get_build_base_info(3, 9) -> {100310,3, 9,1,63000,7020000,0,9,"帮派商店","100110","100311","可以购买帮派商店10级物品","升级后帮派成员玩家可以在帮派商店购买相应等级的物品。"};
get_build_base_info(3, 10) -> {100311,3, 10,1,77400,14040000,0,10,"帮派商店","100111","100312","升级可以减少购买时消耗的财富10%。","升级后帮派成员玩家可以在帮派商店购买相应等级的物品。"};
get_build_base_info(3, 11) -> {100312,3, 11,1,91800,28450000,0,11,"帮派商店","100112","100313","升级可以减少购买时消耗的财富20%。","升级后帮派成员玩家可以在帮派商店购买相应等级的物品。"};
get_build_base_info(3, 12) -> {100313,3, 12,1,106200,48472000,0,12,"帮派商店","100113","100314","升级可以减少购买时消耗的财富30%。","升级后帮派成员玩家可以在帮派商店购买相应等级的物品。"};
get_build_base_info(3, 13) -> {100314,3, 13,1,120600,68656000,0,13,"帮派商店","100114","100315","升级可以减少购买时消耗的财富40%。","升级后帮派成员玩家可以在帮派商店购买相应等级的物品。"};
get_build_base_info(3, 14) -> {100315,3, 14,1,135000,147940000,0,14,"帮派商店","100115","100316","升级可以减少购买时消耗的财富50%。","升级后帮派成员玩家可以在帮派商店购买相应等级的物品。"};
get_build_base_info(3, 15) -> {100316,3, 15,1,0,0,0,15,"帮派商店","0","0","该建筑已经是最高等级。","升级后帮派成员玩家可以在帮派商店购买相应等级的物品。"};
get_build_base_info(4, 0) -> {100401,4, 0,1,100,11000,0,0,"帮派仓库","100101","100402","当前帮派仓库有10格位置","升级后提升帮派仓库的容量。"};
get_build_base_info(4, 1) -> {100402,4, 1,1,600,68000,0,10,"帮派仓库","100102","100403","当前帮派仓库有20格位置","升级后提升帮派仓库的容量。"};
get_build_base_info(4, 2) -> {100403,4, 2,1,1500,182000,0,20,"帮派仓库","100103","100404","当前帮派仓库有30格位置","升级后提升帮派仓库的容量。"};
get_build_base_info(4, 3) -> {100404,4, 3,1,5400,612000,0,30,"帮派仓库","100104","100405","当前帮派仓库有40格位置","升级后提升帮派仓库的容量。"};
get_build_base_info(4, 4) -> {100405,4, 4,1,8400,968000,0,40,"帮派仓库","100105","100406","当前帮派仓库有50格位置","升级后提升帮派仓库的容量。"};
get_build_base_info(4, 5) -> {100406,4, 5,1,12000,1400000,0,50,"帮派仓库","100106","100407","当前帮派仓库有60格位置","升级后提升帮派仓库的容量。"};
get_build_base_info(4, 6) -> {100407,4, 6,1,18900,2226000,0,60,"帮派仓库","100107","100408","当前帮派仓库有70格位置","升级后提升帮派仓库的容量。"};
get_build_base_info(4, 7) -> {100408,4, 7,1,36000,4048000,0,70,"帮派仓库","100108","100409","当前帮派仓库有80格位置","升级后提升帮派仓库的容量。"};
get_build_base_info(4, 8) -> {100409,4, 8,1,48600,5436000,0,80,"帮派仓库","100109","100410","当前帮派仓库有90格位置","升级后提升帮派仓库的容量。"};
get_build_base_info(4, 9) -> {100410,4, 9,1,63000,7020000,0,90,"帮派仓库","100110","100411","当前帮派仓库有100格位置","升级后提升帮派仓库的容量。"};
get_build_base_info(4, 10) -> {100411,4, 10,1,77400,10040000,0,100,"帮派仓库","100111","100412","当前帮派仓库有110格位置","升级后提升帮派仓库的容量。"};
get_build_base_info(4, 11) -> {100412,4, 11,1,91800,20450000,0,110,"帮派仓库","100112","100413","当前帮派仓库有120格位置","升级后提升帮派仓库的容量。"};
get_build_base_info(4, 12) -> {100413,4, 12,1,106200,42472000,0,120,"帮派仓库","100113","100414","当前帮派仓库有130格位置","升级后提升帮派仓库的容量。"};
get_build_base_info(4, 13) -> {100414,4, 13,1,120600,74656000,0,130,"帮派仓库","100114","100415","当前帮派仓库有140格位置","升级后提升帮派仓库的容量。"};
get_build_base_info(4, 14) -> {100415,4, 14,1,135000,107940000,0,140,"帮派仓库","100115","100416","当前帮派仓库有150格位置","升级后提升帮派仓库的容量。"};
get_build_base_info(4, 15) -> {100416,4, 15,1,0,0,0,150,"帮派仓库","0","0","该建筑已经是最高等级。","升级后提升帮派仓库的容量。"};
get_build_base_info(5, 0) -> {100501,5, 0,1,100,11000,0,0,"帮派祭坛","100101","100502","当前每天可以祈福2次","帮众可以通过祈福来获取丰富奖励。"};
get_build_base_info(5, 1) -> {100502,5, 1,1,600,68000,0,2,"帮派祭坛","100102","100503","当前每天可以祈福4次","帮众可以通过祈福来获取丰富奖励。"};
get_build_base_info(5, 2) -> {100503,5, 2,1,1500,182000,0,4,"帮派祭坛","100103","100504","当前每天可以祈福6次","帮众可以通过祈福来获取丰富奖励。"};
get_build_base_info(5, 3) -> {100504,5, 3,1,5400,612000,0,6,"帮派祭坛","100104","100505","当前每天可以祈福8次","帮众可以通过祈福来获取丰富奖励。"};
get_build_base_info(5, 4) -> {100505,5, 4,1,8400,968000,0,8,"帮派祭坛","100105","100506","当前每天可以祈福10次","帮众可以通过祈福来获取丰富奖励。"};
get_build_base_info(5, 5) -> {100506,5, 5,1,12000,1400000,0,10,"帮派祭坛","100106","100507","当前每天可以祈福12次","帮众可以通过祈福来获取丰富奖励。"};
get_build_base_info(5, 6) -> {100507,5, 6,1,18900,2226000,0,12,"帮派祭坛","100107","100508","当前每天可以祈福14次","帮众可以通过祈福来获取丰富奖励。"};
get_build_base_info(5, 7) -> {100508,5, 7,1,36000,4048000,0,14,"帮派祭坛","100108","100509","当前每天可以祈福16次","帮众可以通过祈福来获取丰富奖励。"};
get_build_base_info(5, 8) -> {100509,5, 8,1,48600,5436000,0,16,"帮派祭坛","100109","100510","当前每天可以祈福18次","帮众可以通过祈福来获取丰富奖励。"};
get_build_base_info(5, 9) -> {100510,5, 9,1,63000,7020000,0,18,"帮派祭坛","100110","100511","当前每天可以祈福20次","帮众可以通过祈福来获取丰富奖励。"};
get_build_base_info(5, 10) -> {100511,5, 10,1,77400,10040000,0,20,"帮派祭坛","100111","100512","当前每天可以祈福22次","帮众可以通过祈福来获取丰富奖励。"};
get_build_base_info(5, 11) -> {100512,5, 11,1,91800,20450000,0,22,"帮派祭坛","100112","100513","当前每天可以祈福24次","帮众可以通过祈福来获取丰富奖励。"};
get_build_base_info(5, 12) -> {100513,5, 12,1,106200,42472000,0,24,"帮派祭坛","100113","100514","当前每天可以祈福26次","帮众可以通过祈福来获取丰富奖励。"};
get_build_base_info(5, 13) -> {100514,5, 13,1,120600,74656000,0,26,"帮派祭坛","100114","100515","当前每天可以祈福28次","帮众可以通过祈福来获取丰富奖励。"};
get_build_base_info(5, 14) -> {100515,5, 14,1,135000,107940000,0,28,"帮派祭坛","100115","100516","当前每天可以祈福30次","帮众可以通过祈福来获取丰富奖励。"};
get_build_base_info(5, 15) -> {100516,5, 15,1,0,0,0,30,"帮派祭坛","0","0","该建筑已经是最高等级。",""};
get_build_base_info(6, 0) -> {100601,6, 0,5,0,0,10,0,"帮派厢房","0","100513","当前增加成员上限数5","升级能够提高帮派的成员人数上限，使用元宝升级。"};
get_build_base_info(6, 1) -> {100602,6, 1,5,0,0,50,5,"帮派厢房","0","100514","当前增加成员上限数10","升级能够提高帮派的成员人数上限，使用元宝升级。"};
get_build_base_info(6, 2) -> {100603,6, 2,5,0,0,150,10,"帮派厢房","0","100515","当前增加成员上限数15","升级能够提高帮派的成员人数上限，使用元宝升级。"};
get_build_base_info(6, 3) -> {100604,6, 3,5,0,0,400,15,"帮派厢房","0","100516","当前增加成员上限数20","升级能够提高帮派的成员人数上限，使用元宝升级。"};
get_build_base_info(6, 4) -> {100605,6, 4,5,0,0,800,20,"帮派厢房","0","100517","当前增加成员上限数25","升级能够提高帮派的成员人数上限，使用元宝升级。"};
get_build_base_info(6, 5) -> {100606,6, 5,5,0,0,0,25,"帮派厢房","0","0","升级该建筑已经是最高级。","升级能够提高帮派的成员人数上限，使用元宝升级。"};
get_build_base_info(_Type, _Level) -> {99999,99999,99999,99999,99999,99999,99999,99999,"99999","99999","99999","99999","999999"}.
%% 获取帮派祭坛宝箱
%% 列表ID,宝箱级别,道具ID,数量,概率值
get_altar_goods() ->
	AltarGoods = [
{1001, 1, 501202, 1, 40},{1002, 1, 112301, 1, 30},{1003, 1, 612501, 1, 10},{1004, 1, 206101, 1, 15},{1005, 1, 206101, 1, 8},{1006, 1, 205101, 1, 20},{1007, 1, 222001, 1, 6},{1008, 1, 222101, 1, 6},{1009, 1, 621301, 1, 25},{1010, 1, 211001, 1, 25},{1011, 1, 111041, 1, 30},{1012, 2, 221101, 3, 40},{1013, 2, 221102, 1, 30},{1014, 2, 221103, 1, 10},{1015, 2, 112301, 3, 24},{1016, 3, 601601, 1, 3},{1017, 3, 621302, 1, 22},{1018, 3, 211002, 1, 22},{1019, 3, 611601, 1, 20},{1020, 4, 621302, 1, 10},{1021, 4, 211002, 1, 10},{1022, 4, 501202, 2, 15},{1023, 5, 112301, 2, 10},{1024, 5, 501202, 2, 6},{1025, 5, 205201, 1, 5},{1026, 5, 206201, 1, 5},{1027, 6, 501202, 2, 3},{1028, 6, 611601, 1, 3},{1029, 7, 501202, 2, 2},{1030, 7, 501202, 2, 1},{1031, 8, 205301, 1, 1},{1032, 8, 206301, 1, 4},{1033, 9, 611601, 1, 10},{1034, 10, 221103, 1, 5}
	    	],
	AltarGoods.

%% 获取帮派祭坛每次祈祷的花费
%% @param 祭坛等级
get_altar_pray(1) -> 20;get_altar_pray(2) -> 20;get_altar_pray(3) -> 20;get_altar_pray(4) -> 20;get_altar_pray(5) -> 20;get_altar_pray(6) -> 20;get_altar_pray(7) -> 20;get_altar_pray(8) -> 20;get_altar_pray(9) -> 20;get_altar_pray(10) -> 20;get_altar_pray(11) -> 20;get_altar_pray(12) -> 20;get_altar_pray(13) -> 20;get_altar_pray(14) -> 20;get_altar_pray(15) -> 20;
	    		get_altar_pray(_) -> 999999.

%% 商城兑换物品配置
%% 物品类型Id，单位数量所需财富，单位数量，各等级商城每人每天最多兑换数，兑换的日常ID，可以兑换的等级区间
get_guild_mall_goods_list() ->
    [
{501202,  5,1, 1, [0,2,3,4,5,6,7,8,9,10,11,12,13,14,15], 4009009, 1,100},{501203,  5,1, 1, [0,0,0,0,0,0,0,0,0,0,0,0,0,0,8], 4009019, 1,100},{501203,  6,1, 1, [0,0,0,0,0,0,0,0,0,0,0,0,0,8,0], 4009019, 1,100},{501203,  7,1, 1, [0,0,0,0,0,0,0,0,0,0,0,0,8,0,0], 4009019, 1,100},{501203,  8,1, 1, [0,0,0,0,0,0,0,0,0,0,0,8,0,0,0], 4009019, 1,100},{501203,  9,1, 1, [0,0,0,0,0,0,0,0,0,0,8,0,0,0,0], 4009019, 1,100},{501203,  10,1, 1, [0,0,1,2,3,4,5,6,7,8,0,0,0,0,0], 4009019, 1,100},{612501,  5,1, 1, [0,0,0,0,0,0,0,0,0,0,0,0,0,0,15], 4009011, 1,100},{612501,  6,1, 1, [0,0,0,0,0,0,0,0,0,0,0,0,0,14,0], 4009011, 1,100},{612501,  7,1, 1, [0,0,0,0,0,0,0,0,0,0,0,0,13,0,0], 4009011, 1,100},{612501,  8,1, 1, [0,0,0,0,0,0,0,0,0,0,0,12,0,0,0], 4009011, 1,100},{612501,  9,1, 1, [0,0,0,0,0,0,0,0,0,0,11,0,0,0,0], 4009011, 1,100},{612501,  10,1, 1, [0,0,3,4,5,6,7,8,9,10,0,0,0,0,0], 4009011, 1,100}
	    		].

%% 获取帮派神兽相关信息
%% @param 等级
%% 等级 成长度 造型ID 召唤(升级所需铜币)  第一名礼包 第二/三名礼包
get_guild_godanimal_info(35) -> {35,2000,10501,200000,532201,532202};
get_guild_godanimal_info(36) -> {36,3200,10502,320000,532201,532202};
get_guild_godanimal_info(37) -> {37,3400,10503,340000,532201,532202};
get_guild_godanimal_info(38) -> {38,3600,10504,360000,532201,532202};
get_guild_godanimal_info(39) -> {39,4800,10505,480000,532201,532202};
get_guild_godanimal_info(40) -> {40,5000,10508,500000,532203,532204};
get_guild_godanimal_info(41) -> {41,5200,10509,520000,532203,532204};
get_guild_godanimal_info(42) -> {42,5400,10510,540000,532203,532204};
get_guild_godanimal_info(43) -> {43,5600,10511,560000,532203,532204};
get_guild_godanimal_info(44) -> {44,5800,10512,580000,532203,532204};
get_guild_godanimal_info(45) -> {45,6000,10513,600000,532203,532204};
get_guild_godanimal_info(46) -> {46,8100,10514,810000,532203,532204};
get_guild_godanimal_info(47) -> {47,8300,10515,830000,532203,532204};
get_guild_godanimal_info(48) -> {48,8500,10516,850000,532203,532204};
get_guild_godanimal_info(49) -> {49,8700,10517,870000,532203,532204};
get_guild_godanimal_info(50) -> {50,8900,10518,890000,532205,532206};
get_guild_godanimal_info(51) -> {51,9100,10519,910000,532205,532206};
get_guild_godanimal_info(52) -> {52,9300,10520,930000,532205,532206};
get_guild_godanimal_info(53) -> {53,9500,10521,950000,532205,532206};
get_guild_godanimal_info(54) -> {54,9700,10522,970000,532205,532206};
get_guild_godanimal_info(55) -> {55,10000,10523,1000000,532205,532206};
get_guild_godanimal_info(56) -> {56,10300,10524,1030000,532205,532206};
get_guild_godanimal_info(57) -> {57,10600,10525,1060000,532205,532206};
get_guild_godanimal_info(58) -> {58,10900,10526,1090000,532205,532206};
get_guild_godanimal_info(59) -> {59,11200,10527,1120000,532205,532206};
get_guild_godanimal_info(60) -> {60,11500,10528,1150000,532207,532208};
get_guild_godanimal_info(61) -> {61,11500,10529,1150000,532207,532208};
get_guild_godanimal_info(62) -> {62,11500,10530,1150000,532207,532208};
get_guild_godanimal_info(63) -> {63,11500,10531,1150000,532207,532208};
get_guild_godanimal_info(64) -> {64,11500,10601,1150000,532207,532208};
get_guild_godanimal_info(65) -> {65,11500,10602,1150000,532207,532208};
get_guild_godanimal_info(_LEVEL) -> [].