%%%-----------------------------------
%%% @Module  : data_team_text
%%% @Author  : zhenghehe
%%% @Created : 2011.06.14
%%% @Description: 中文文本
%%%-----------------------------------
-module(data_team_text).
-compile(export_all).

get_team_msg(Type) ->
    case Type of
        1 ->
            "加入了队伍";
        2 ->
            "入队请求已发出，等待队长回应";
        3 ->
            "的队伍";
        4 ->
            " 下线了，暂时离开了队伍";
        5 ->
            "邀请入队请求已发出，等待对方回应";
        6 ->
            "被队长请出队伍";
        7 ->
            " 归队了";
        8 ->
            "你成功进入离线前的队伍";
        9 ->
            <<"还有队员在副本（或其他副本）中，无法创建新副本!">>;
        10 ->
            " 拒绝了您的组队邀请";
        11 ->
            "你离线前的队伍已不存在";
        12 ->
            "你离线时间超过5分钟，不能自动进入原来的队伍";
        13 ->	
            "你离线前所属的队伍人数已满"
    end.