%%%------------------------------------
%%% @Module  : data_city_war_text
%%% @Author  : guoxi
%%% @Email   : 178912295@qq.com
%%% @Created : 2012.12.13
%%% @Description: 城战
%%%------------------------------------
-module(data_city_war_text).
-export(
    [
        get_city_war_text/1,
        get_city_war_error_tips/1
    ]
).

get_city_war_text(Type) ->
    case Type of
        1 -> "援助审批结果";
        2 -> "~ts 帮派（进攻帮派）同意了你帮派的援助";
        3 -> "~ts 帮派（进攻帮派）拒绝了你帮派的援助";
        4 -> "~ts 帮派（防守帮派）同意了你帮派的援助";
        5 -> "~ts 帮派（防守帮派）拒绝了你帮派的援助";
        6 -> "攻城战奖励";
        7 -> "你所在帮派参加攻城战并获得胜利，离线玩家通过邮件发送结算奖励！";
        8 -> "你所在帮派参加攻城战不幸失败，离线玩家通过邮件发送结算奖励！";
        9 -> "攻城战城主奖励";
        10 -> "你所在的帮派参加攻城战并获得胜利，城主获得额外100万非绑定铜币奖励，已通过邮件发送，请查收。";
        11 -> "攻城战胜利奖励";
        12 -> "恭喜你的帮派获得了攻城战的胜利，成功占领长安城。";
        13 -> "攻城战参与奖励";
        14 -> "很遗憾，你的帮派没能取得攻城战的胜利。";
        15 -> "无法领取攻城战奖励";
        16 -> "攻城战表现不给力，获取不足 ~p 战功声望，故无法领取相应礼包奖励，攻城战内击杀其他玩家可以获得大量战功声望，请下次继续努力哦！";
        17 -> "攻城战胜利（援助）奖励";
        18 -> "攻城战参与（援助）奖励";
        19 -> "恭喜你的帮派（援助）获得了攻城战的胜利。";
        20 -> "很遗憾，你的帮派（援助）没能取得攻城战的胜利。";
        21 -> "进攻方";
        22 -> "防守方";
        23 -> "攻城战副帮主奖励";
        24 -> "你所在的帮派参加攻城战并获得胜利，副帮主获得额外20万非绑定铜币奖励，已通过邮件发送，请查收。";
        25 -> "攻城战撤销通知";
        26 -> "~ts 帮派（进攻帮派）撤销了你帮派的援助";
        27 -> "~ts 帮派（防守帮派）撤销了你帮派的援助";
        28 -> "攻城战无法开启通知";
        29 -> "亲爱的玩家：由于本服攻城战未达到开启条件，本周晚上的攻城战（20：30）将更改为帮派战。";
        _ -> ""
    end.

get_city_war_error_tips(Type) ->
    case Type of
        0 -> "失败，不是活动日";
        1 -> "失败，操作失败";
        2 -> "成功";
        3 -> "失败，报名已结束，不允许该操作";
        4 -> "失败，未申请对该对象进行援助";
        5 -> "失败，获取帮派信息失败";
        6 -> "失败，只有帮主或副帮主才能进行该操作";
        7 -> "失败，只有进攻方帮主或副帮主才能进行该操作";
        8 -> "失败，只有防守方帮主或副帮主才能进行该操作";
        9 -> "失败，没有进攻方";
        10 -> "失败，该帮派没有申请进攻援助";
        11 -> "失败，该帮派没有申请防守援助";
        12 -> "失败，只有进攻方或防守方的帮主或副帮主才能进行该操作";
        13 -> "失败，只有帮派周积分前5名的帮派能才进行抢夺";
        14 -> "失败，防守方不能抢夺进攻权";
        15 -> "失败，进攻方和防守方不能进行援助操作";
        16 -> "失败，非绑定铜币不足";
        17 -> "失败，已申请援助的帮派不能抢夺进攻权";
        18 -> "正在排队退出场景";
        19 -> "失败，未加入任何帮派";
        20 -> "失败，不在活动时间内";
        21 -> "失败，所在帮派未参加攻城战";
        22 -> "正在排队进入活动场景";
        23 -> "失败，~ts已超过活动最大参与人数(150人)";
        24 -> "失败，等级大于35级的玩家才能进入";
        25 -> "失败，当前场景中的医仙已经达到上限";
        26 -> "失败，当前场景中的鬼巫已经达到上限";
        27 -> "失败，获取玩家信息失败";
        28 -> "失败，已变换职业";
        29 -> "失败，获取坐标失败";
        30 -> "失败，需要在复活点附近才能变换职业";
        31 -> "失败，无法变换该职业";
        32 -> "失败，该场景无法进入攻城战";
        33 -> "成功援助进攻帮派 ~ts, 等待审批中";
        34 -> "成功援助防守帮派 ~ts, 等待审批中";
        35 -> "失败，审批时间已过";
        36 -> "失败，死亡不能进行职业变换";
        37 -> "失败，只有攻城战获胜帮派的成员才能领取该BUFF";
        38 -> "失败，今天已领取";
        39 -> "领取成功";
        40 -> "失败，当前状态不允许传送进入";
        41 -> "失败，本周已领取";
        42 -> "失败，帮派等级大于或等于2级才能抢夺进攻权";
        43 -> "失败，援助帮派数量已达5个";
        44 -> "失败，该帮派不是援助帮派";
        45 -> "成功撤销";
        46 -> "捐献必须大于50000铜币";
        47 -> "失败，已过抢夺时间";
        48 -> "失败，已过审批时间";
        _ -> ""
    end.
