%%%------------------------------------
%%% @Module  : data_marriage_text
%%% @Author  : guoxi
%%% @Email   : guoxi@jieyou.cn
%%% @Created : 2012.9.25
%%% @Description: 结婚
%%%------------------------------------
-module(data_marriage_text).
-compile(export_all).

get_marriage_text(Type) ->
    case Type of
	0 ->
	    "婚宴邀请函";
        1 ->
            "千里姻缘一线牵，";
        2 ->
            "喜结良缘，相约共伴一生。于";
        3 ->
            "点大摆喜宴，特邀请您参加，希望您到场，送上您的一份祝福！";
        4 ->
            "结婚祝福";
        5 ->
            "恭喜您和";
        6 ->
            "相遇相知，相濡以沫，最终喜结连理，走入婚姻的殿堂。现大闹天宫特为您准备了至尊贺礼";
        7 ->
            "级白首到老戒指，祝福你们从此情定三生，共大闹天宫！";
        8 ->
            "与";
        9 ->
            "的婚礼";
        10 ->
            "婚宴倒计时";
        11 ->
            "亲爱的玩家，婚礼即将于10分钟后开启，请安排好您的时间，和您的伴侣共同见证浪漫一刻。";
        12 ->
            "和";
        13 ->
            "喜结良缘贺礼到";
        14 ->
            "亲爱的玩家：\n恭喜您与您的TA在活动期间结成夫妻，祝您新婚愉快，愿永结同心，白首不相离。大闹天宫送上贺礼一份，请查收哦！";
        15 ->
            "嘉宾祝福发送";
        16 ->
            "您的好友";
        17 ->
            "送上贺礼";
        18 ->
            "铜币，恭祝您新婚快乐";
        19 ->
            "朵玫瑰，恭祝您新婚快乐";
        20 ->
            "的";
        21 ->
            "普通";
        22 ->
            "热闹";
        23 ->
            "豪华";
        24 ->
            "婚礼将在10分钟后准时举行，望亲朋好友准时参加！";
        25 ->
            "婚礼正式开始了，大家祝福这对神仙眷侣吧！";
        26 ->
            "婚宴气氛值奖励";
        27 ->
            "恭喜您在游戏中喜获良人，成就一段神仙眷侣的千古佳话。在您举办的婚宴上，气氛值达到1000，月老特为您准备了喜服时装变换卷礼物，祝您与TA白首偕老。";
        28 ->
            "成功预约巡游";
        29 ->
            "您成功预约了~p：30的皇家巡游，请安排好您的时间，和您的伴侣共同见证浪漫一刻。";
        30 ->
            "巡游倒计时";
        31 ->
            "亲爱的玩家，您预约的巡游即将于5分钟后开启，请安排好您的时间，和您的伴侣共同见证浪漫一刻。";
        32 ->
            "~ts 和 ~ts 预约的 ~ts 巡游将在5分钟后开始，愿大家共同见证幸福和美满！";
        33 ->
            "~ts 和 ~ts 预约的 ~ts 巡游开始了，来共同见证这对璧人的幸福美满吧！";
        34 ->
            "温馨";
        35 ->
            "浪漫";
        36 ->
            "皇家";
        37 ->
            "巡游祝福";
        38 ->
            "恭喜您在举办 ~ts 型巡游的过程中，气氛值达到 ~ts，特送上 ~ts 喜服挂饰变换卷，祝福祝福你们从此情定三生，共大闹天宫！";
        39 ->
            "全城秀恩爱，甜蜜有礼送";
        40 ->
            "亲爱的玩家：\n恭喜您与您的TA喜结良缘并开启结婚巡游，在全世界面前秀出你们的恩爱，甜蜜无限，大闹天宫送上好礼一份，祝贺白头到老，圆圆满满哦！";
        41 ->
            " 1 天";
        42 -> 
            " 7 天";
        43 ->
            " 永久 ";
        44 ->
            "离婚通知";
        45 ->
            "您3日前的离婚协议已正式生效，与对方夫妻关系取消!";
        46 ->
            "强制离婚成功";
        47 ->
            "您已成功申请强制离婚，与伴侣解除了夫妻关系，恢复自由之身!";
        48 ->
            "离婚通知";
        49 ->
            "由于您的伴侣与您产生了感情分裂，已强制与您解除了夫妻关系，您已回复自由之身!";
        50 ->
            "申请离婚成功";
        51 ->
            "您已成功申请离婚，与伴侣解除了夫妻关系，恢复自由之身！";
        52 ->
            "由于您连续超过7天未上线，您的伴侣与您解除了夫妻关系，您已回复自由之身！";
        53 ->
            "协议离婚成功";
        54 ->
            "您已成功与伴侣申请协议离婚，离婚协议将于 ~p年~p月~p日~p时~p分~p秒 生效！";
        55 ->
            "巡游戒指发放";
        56 ->
            "恭喜您与您的伴侣举办了巡游，可获得婚戒一枚，敬请查收！"
    end.

get_text() ->
    [<<"与">>, <<"的专属戒指">>].

get_error_text(Type) ->
    case Type of
        1 ->
            "失败，未结婚";
        2 ->
            "失败，已申请强制离婚";
        3 ->
            "失败，已预约或正在举办婚宴";
        4 ->
            "失败，已预约或正在举办巡游";
        5 ->
            "失败，伴侣不在线";
        6 ->
            "失败，元宝不足";
        7 ->
            "失败，协议离婚失败";
        8 ->
            "申请成功，3天后确认即可成功离婚";
        9 ->
            "离婚成功";
        10 ->
            "取消成功";
        11 ->
            "失败，离婚协议等待生效中";
        12 ->
            "双方离婚协议已生效，3天后自动取消夫妻关系";
        21 ->
            "失败，申请强制离婚需要3天审核时间";
        31 ->
            "失败，必须伴侣7天内未上线";
        41 ->
            "失败，未申请协议离婚";
        42 ->
            "失败，只能由申请者取消";
        50 ->
            "失败，未结婚";
        51 ->
            "失败，获取信息失败";
        52 ->
            "失败，领奖失败";
        53 ->
            "失败，背包容量不足";
        54 ->
            "失败，任务未完成";
        55 ->
            "失败，无该任务";
        60 ->
            "夫妻情缘任务（1）";
        61 ->
            "夫妻情缘任务（2）";
        62 ->
            "夫妻情缘任务（3）";
        63 ->
            "夫妻共同完成仙侣情缘任务9次";
        64 ->
            "夫妻共同完成仙侣情缘任务22次";
        65 ->
            "夫妻共同完成仙侣情缘任务99次";
        66 ->
            "夫妻等级（1）";
        67 ->
            "夫妻等级（2）";
        68 ->
            "夫妻等级（3）";
        69 ->
            "夫妻双方等级都达到55级";
        70 ->
            "夫妻双方等级都达到60级";
        71 ->
            "夫妻双方等级都达到65级";
        72 ->
            "夫妻多人副本（1）";
        73 ->
            "夫妻多人副本（2）";
        74 ->
            "夫妻多人副本（3）";
        75 ->
            "夫妻组队完成多人九重天副本次数达到9次";
        76 ->
            "夫妻组队完成多人九重天副本次数达到22次";
        77 ->
            "夫妻组队完成多人九重天副本次数达到99次";
        78 ->
            "夫妻技能（1）";
        79 ->
            "夫妻技能（2）";
        80 ->
            "夫妻技能（3）";
        81 ->
            "夫妻在同一场景里共同使用夫妻技能次数达到99次";
        82 ->
            "夫妻在同一场景里共同使用夫妻技能次数达到222次";
        83 ->
            "夫妻在同一场景里共同使用夫妻技能次数达到999次";
        84 ->
            "夫妻恩爱秀（1）";
        85 ->
            "夫妻恩爱秀（2）";
        86 ->
            "夫妻恩爱秀（3）";
        87 ->
            "两人完成真爱考验结为夫妇";
        88 ->
            "两人完成真爱考验结为夫妇并举办婚宴";
        89 ->
            "两人完成真爱考验结为夫妇并举办巡游";
        90 ->
            "结婚纪念日（1）";
        91 ->
            "结婚纪念日（2）";
        92 ->
            "结婚纪念日（3）";
        93 ->
            "结婚纪念日（4）";
        94 ->
            "结婚纪念日（5）";
        95 ->
            "夫妻结婚7天纪念日";
        96 ->
            "夫妻结婚15天纪念日";
        97 ->
            "夫妻结婚30天纪念日";
        98 ->
            "夫妻结婚60天纪念日";
        99 ->
            "夫妻结婚90天纪念日";
        101 ->
            "结婚纪念日（6）";
        102 ->
            "结婚纪念日（7）";
        103 ->
            "结婚纪念日（8）";
        104 ->
            "结婚纪念日（9）";
        105 -> 
            "夫妻结婚120天纪念日";
        106 ->
            "夫妻结婚150天纪念日";
        107 ->
            "夫妻结婚180天纪念日";
        108 ->
            "夫妻结婚210天纪念日"
    end.
