%%------------------------------------------------------------------------------
%% @Module  : data_quiz_text
%% @Author  : liangjianxiong
%% @Email   : ljianxiong@qq.com
%% @Created : 2012.5.31
%% @Description: 答题中文文本
%%------------------------------------------------------------------------------

-module(data_quiz_text).
-compile(export_all).


get_subject_type(Type) ->
    case Type of
        1 ->
           <<"影视类">>;
        2 ->
           <<"动漫类">>;
        3 ->
           <<"时事类">>;
        4 ->
           <<"游戏类">>;
        5 ->
           <<"常识类">>;
        6 ->
           <<"趣味类">>;
        7 ->
           <<"诗词类">>;
        8 ->
           <<"数学类">>;
        9 ->
           <<"元宵灯谜">>;
        _ ->
           <<"主题类">>
    end.

