%%%--------------------------------------
%%% @Module  : data_merge_text
%%% @Author  : calvin
%%% @Email   : calvinzhong888@gmail.com
%%% @Created : 2012.9.26
%%% @Description: 合服活动
%%%--------------------------------------

-module(data_merge_text).
-compile(export_all).

%% 排行榜相关标题：
get_rank_title(1001, 1) -> ["战力榜第1名（合服活动）"];
get_rank_title(1001, 2) -> ["战力榜第2-5名（合服活动）"];
get_rank_title(1001, 3) -> ["战力榜第6-10名（合服活动）"];
get_rank_title(2001, 1) -> ["宠物战力榜第1名（合服活动）"];
get_rank_title(2001, 2) -> ["宠物战力榜第2-5名（合服活动）"];
get_rank_title(2001, 3) -> ["宠物战力榜第6-10名（合服活动）"];
get_rank_title(5001, 1) -> ["竞技场积分第1名（合服活动）"];
get_rank_title(5001, 2) -> ["竞技场积分第2-5名（合服活动）"];
get_rank_title(5001, 3) -> ["竞技场积分第6-10名（合服活动）"];
get_rank_title(4, 1) -> ["帮战积分第1名（合服活动）"];
get_rank_title(4, 2) -> ["帮战积分第2-5名（合服活动）"];
get_rank_title(4, 3) -> ["帮战积分第6-10名（合服活动）"];
get_rank_title(_, _) -> [""].

%% 排行榜相关内容：
get_rank_content(1001, 1) -> ["恭喜您在合服活动中获得了战力榜排行第1名的成绩！为您送上丰厚奖励一份！"];
get_rank_content(1001, 2) -> ["恭喜您在合服活动中获得了战力榜排行第2-5名的成绩！为您送上丰厚奖励一份！"];
get_rank_content(1001, 3) -> ["恭喜您在合服活动中获得了战力榜排行第6-10名的成绩！为您送上丰厚奖励一份！"];
get_rank_content(2001, 1) -> ["恭喜您在合服活动中获得了宠物战力榜排行第1名的成绩！为您送上丰厚奖励一份！"];
get_rank_content(2001, 2) -> ["恭喜您在合服活动中获得了宠物战力榜排行第2-5名的成绩！为您送上丰厚奖励一份！"];
get_rank_content(2001, 3) -> ["恭喜您在合服活动中获得了宠物战力榜排行第6-10名的成绩！为您送上丰厚奖励一份！"];
get_rank_content(5001, 1) -> ["恭喜您在合服活动中获得了竞技场积分第1名的成绩！为您送上丰厚奖励一份！"];
get_rank_content(5001, 2) -> ["恭喜您在合服活动中获得了竞技场积分第2-5名的成绩！为您送上丰厚奖励一份！"];
get_rank_content(5001, 3) -> ["恭喜您在合服活动中获得了竞技场积分第6-10名的成绩！为您送上丰厚奖励一份！"];
get_rank_content(4, 1) -> ["恭喜您的帮会在合服活动中获得帮战积分第1名的成绩！为您送上丰厚奖励一份！"];
get_rank_content(4, 2) -> ["恭喜您的帮会在合服活动中获得了帮战积分第2-5名的成绩！为您送上丰厚奖励一份！"];
get_rank_content(4, 3) -> ["恭喜您的帮会在合服活动中获得了帮战积分第6-10名的成绩！为您送上丰厚奖励一份！"];
get_rank_content(_, _) -> [""].

%% 名人堂投票补偿
get_fame_vote_title() -> "名人堂 ~s 称号竞争奖励".
get_fame_vote_content() -> "您参与了名人堂 ~s 称号的竞争，获得礼包奖励。支持度统计如下：\n~s".
