%%%-----------------------------------
%%% @Module  : data_yunbiao_text
%%% @Author  : zhenghehe
%%% @Created : 2011.06.14
%%% @Description: 中文文本
%%%-----------------------------------
-module(data_yunbiao_text).
-compile(export_all).

get_intercept(Type) ->
    case Type of
        1 ->
            "同一国家不能劫镖！";
        2 ->
            "劫镖失败，对方被劫次数已满2次！";
        3 ->
            "劫镖失败，您今天劫镖次数已满2次！";
        4 ->
            "劫镖失败，您今天劫镖次数已满2次！";
        5 ->
            "对方镖车为 ~p 级，您不能劫他的镖！";
        6 ->
            "劫镖成功，获得 ~p 绑定铜币, ~p 铜币";
        7 ->
            "国运期间，劫镖奖励双倍！";
        8 ->
            "劫镖成功，获得 ~p 绑定铜币, ~p 铜币";
        9 ->
            "扣除运镖押金";
        10 ->
            "铜币不足，无法支付运镖任务的保证金";
        11 ->
            "你正在运镖中";
        12 ->
            <<"任务出错">>;
        13 ->
            <<"你已经完成过这次的任务了">>;
        14 ->
            "任务超时";
        15 ->
            "国运期间，运镖奖励双倍！ 获得 ~p 铜币， ~p 绑定铜币";
        16 ->
            "恭喜您，运镖成功， 获得 ~p 铜币， ~p 绑定铜币";
        17 ->
            <<"你必须在国都交任务">>;
        18 ->
            <<"任务出错">>;
		19 ->
            "运镖任务奖励"
    end.

get_transport(Type) ->
    case Type of
        1 ->
            <<"切换场景请先暂停离线挂机">>;
        2 ->
            <<"本地图不支持传送">>;
        3 ->
            <<"运镖中不能传送">>;
        4 ->
            <<"不存在该场景">>;
        5 ->
            "等级不够~p级，无法传入该场景"
    end.

get_reward() ->
    ["护送美女任务奖励", "恭喜您在护送美女任务中获得经验~p, 铜币~p！"].
