%%%-----------------------------------
%%% @Module  : data_pet_text
%%% @Author  : zhenghehe
%%% @Created : 2011.06.14
%%% @Description: 中文文本
%%%-----------------------------------
-module(data_pet_text).
-compile(export_all).

get_msg(Type) ->
    case Type of
        1 ->
            "等级~p=>~p";
        2 ->
            "[成长] ~p, ~p, ~p, ~p, ~p";
        3 ->
            "~s,等级~p,资质~p/~p,成长~p,潜能~p";
        4 ->
            "主宠:~s,等级~p,资质~p/~p,成长~p,潜能~p; 副宠:~s,等级~p,资质~p/~p,成长~p,潜能~p";
        5 ->
            "潜能类型:~p, 名字:~s, 经验:~p, 等级:~p";
        6 ->
            "宠物继承";
        7 ->
            "[宠物孵化] 形象:~p, 资质:~p, 成长:~p, 成长上限:~p";
        8 ->
            "[砸蛋] 成长:~p, 资质:~p, 花费:~p, 经验倍率:~p, 经验值:~p, 是否再次砸蛋:~p";
        9 ->
            ["宠物升级", "恭喜您的宠物【~s】达到【~p】级，你可以打开屏幕下方的宠物面板或按【快捷键W】查看并加点，宠物每升一级可拥有2个可分配的属性点。"];
        10 ->
            "属性还童";
        11 ->
            <<"鸿运当头，成长值+1">>;
        12 ->
            <<"获得5倍经验，成长经验 +~p">>;
        13 ->
            <<"成长经验 +~p">>;
        14 ->
            <<". ~s潜能等级提升至~p级">>;
        15 ->
            <<"获得~p倍气~s潜能经验，+~p经验">>;
        16 ->
            <<"获得~p倍全部潜能经验，所有潜能+~p经验">>;
	17 ->
	    "成功学习: ~s 技能";
	18 ->
	    "替换成功: ~s 技能替换 ~s 技能";
	19 ->
	    "遗忘: ~s 技能";
	20 ->
	    "~s  技能降级为 ~s"
    end.

get_skill_name_by_skill_id(SkillId) ->
    L = [
	 {621611,"气血Lv1"},{621612,"气血Lv2"},{621613,"气血Lv3"},{621614,"气血Lv4"},
	 {621711,"内力Lv1"},{621712,"内力Lv2"},{621713,"内力Lv3"},{621714,"内力Lv4"},
	 {621811,"攻击Lv1"},{621812,"攻击Lv2"},{621813,"攻击Lv3"},{621814,"攻击Lv4"},
	 {621911,"防御Lv1"},{621912,"防御Lv2"},{621913,"防御Lv3"},{621914,"防御Lv4"},
	 {622011,"命中Lv1"},{622012,"命中Lv2"},{622013,"命中Lv3"},{622014,"命中Lv4"},
	 {622111,"闪避Lv1"},{622112,"闪避Lv2"},{622113,"闪避Lv3"},{622114,"闪避Lv4"},
	 {622211,"暴击Lv1"},{622212,"暴击Lv2"},{622213,"暴击Lv3"},{622214,"暴击Lv4"},
	 {622311,"坚韧Lv1"},{622312,"坚韧Lv2"},{622313,"坚韧Lv3"},{622314,"坚韧Lv4"},
	 {622411,"火抗Lv1"},{622412,"火抗Lv2"},{622413,"火抗Lv3"},{622414,"火抗Lv4"},
	 {622511,"水抗Lv1"},{622512,"水抗Lv2"},{622513,"水抗Lv3"},{622514,"水抗Lv4"},
	 {622611,"毒抗Lv1"},{622612,"毒抗Lv2"},{622613,"毒抗Lv3"},{622614,"毒抗Lv4"},

	 {625111,"幽冥诀Lv1"},{625112,"幽冥诀Lv2"},{625113,"幽冥诀Lv3"},{625114,"命中Lv4"},
	 {625211,"化生诀Lv1"},{625212,"化生诀Lv2"},{625213,"化生诀Lv3"},{625214,"化生诀Lv4"},
	 {625311,"青龙诀Lv1"},{625312,"青龙诀Lv2"},{625313,"青龙诀Lv3"},{625314,"青龙诀Lv4"},
	 {625411,"白虎诀Lv1"},{625412,"白虎诀Lv2"},{625413,"白虎诀Lv3"},{625414,"白虎诀Lv4"},
	 {625511,"玄武诀Lv1"},{625512,"玄武诀Lv2"},{625513,"玄武诀Lv3"},{625514,"玄武诀Lv4"},
	 {625611,"缚妖诀Lv1"},{625612,"缚妖诀Lv2"},{625613,"缚妖诀Lv3"},{625614,"缚妖诀Lv4"},
	 {625711,"化形诀Lv1"},{625712,"化形诀Lv2"},{625713,"化形诀Lv3"},{625714,"化形诀Lv4"},
	 {625811,"驭魂诀Lv1"},{625812,"驭魂诀Lv2"},{625813,"驭魂诀Lv3"},{625814,"驭魂诀Lv4"}
	],
    case lists:keyfind(SkillId, 1, L) of
	false -> "";
	{_, Name} -> Name
    end.

translate_practice_type(Type) ->
    case Type of
	free_practice ->
	    "免费修行";
	medicine_practice ->
	    "道具修行";
	gold_practice ->
	    "元宝修行";
	_ ->
	    ""
    end.

translate_pet_info(InfoList) ->
    [Lv, Aptitude, Growth, [Forza, Wit, Agile, Thew]] = InfoList,
    io_lib:format("等级:~p 资质:~p 成长:~p 力量:~p 灵力:~p 身法:~p 体质:~p",[Lv, Aptitude, Growth, Forza, Wit, Agile, Thew]).


get_mail_title() ->
    "宠物命中技能属性调整说明".
get_mail_content() ->
    "亲爱的玩家：\n为了更好的营造一个平衡的游戏环境，创造更加顺畅的PK体验，本次更新：修复了宠物命中技能属性数值错误的问题，并调整了战斗力计算方式。对于您爱宠的命中属性下降，我们深表歉意，送上一份补偿礼物，祝您游戏愉快！".
