%%%------------------------------------
%%% @Module  : data_vip_text
%%% @Author  : guoxi
%%% @Email   : 178912295@qq.com
%%% @Created : 2012.12.12
%%% @Description: VIP
%%%------------------------------------
-module(data_vip_text).
-compile(export_all).

get_vip_text(Type) ->
    case Type of
		0 ->
			["VIP新服周礼包赠送", "VIP新服周礼包赠送", "VIP新服周礼包赠送"];
        1 ->
            ["亲爱的VIP用户，感谢您对《大闹天宫》的热爱与支持，我们为您精心准备了VIP新服周礼包一份，开服前七天每天赠送，登录就可领取！", "亲爱的VIP用户，感谢您对《大闹天宫》的热爱与支持，我们为您精心准备了VIP新服周礼包一份，开服前七天每天赠送，登录就可领取！", "亲爱的VIP用户，感谢您对《大闹天宫》的热爱与支持，我们为您精心准备了VIP新服周礼包一份，开服前七天每天赠送，登录就可领取！"];
        2 -> 
            "VIP会员卡";
        3 -> 
            "尊敬的用户，您的好友~ts为您购买~tsVIP卡，请注意查收邮件。";
        4 ->
            "周";
        5 ->
            "月";
        6 ->
            "半年";
        7 ->
            "VIP过期通知";
        8 ->
            "尊敬的大闹天宫VIP用户，您的VIP周卡使用日期只剩下一天，为了不影响您继续体验大闹天宫游戏，请您在VIP界面进行续费或升级服务！";
        9 ->
            "尊敬的大闹天宫VIP用户，您的VIP月卡使用日期只剩下三天，为了不影响您继续体验大闹天宫游戏，请您在VIP界面进行续费或升级服务！";
        10 ->
            "尊敬的大闹天宫VIP用户，您的VIP半年卡使用日期只剩下七天，为了不影响您继续体验大闹天宫游戏，请您在VIP界面进行续费或升级服务！";
        11 ->
            "VIP每日福利";
        12 ->
            "尊敬的玩家，您的背包容量不足，领取的VIP每日福利通过邮件发送。";
        _ ->
            ""
    end.

get_vip_error(Type) ->
    case Type of
        0 -> "领取成功";
        1 -> "失败，已领取";
        2 -> "失败，不满足领取条件";
        3 -> "失败，VIP成长等级为0，不满足领取条件";
        4 -> "失败，VIP成长等级为1、2级时需要本周登录3天以上才可领取";
        5 -> "失败，已领取";
        6 -> "失败，背包容量不足";
        7 -> "失败，VIP体验卡不能升级";
        8 -> "失败，不能覆盖当前等级VIP";
        9 -> "失败，元宝不足";
        10 -> "成功";
        11 -> "失败，非VIP不能领取VIP每日福利";
        12 -> "失败，没有该玩家信息";
        13 -> "失败，0级不能进行摇奖";
        14 -> "失败，今天摇奖次数已完";
        15 -> "失败，金币数不足";
        16 -> "失败，背包容量不足";
        17 -> "失败，0级不能进行该操作";
        18 -> "失败，无需清空摇奖物品";
        19 -> "失败，需要3个金币才能清空摇奖";
        20 -> "失败，获取摇奖概率失败";
        21 -> "失败，当前VIP成长等级摇奖次数已完";
        22 -> "失败，只有周VIP、月VIP和半年VIP用户才能进行续费";
        23 -> "失败，背包物品不足";
        24 -> "失败，找不到该物品";
        25 -> "失败，元宝不足";
        26 -> "成功续费~tsVIP ~p 天";
        27 -> "失败，只有周卡和月卡用户能升级VIP";
        28 -> "VIP升级成功";
        29 -> "失败，元宝不足";
        _ -> ""
    end.

get_vip_type_text(Type) ->
    case Type of
        1 -> "周";
        2 -> "月";
        3 -> "半年";
        _ -> ""
    end.
