%%%------------------------------------
%%% @Module  : data_shengxiao_text
%%% @Author  : guoxi
%%% @Email   : 178912295@qq.com
%%% @Created : 2012.7.24
%%% @Description: 生肖大奖
%%%------------------------------------
-module(data_shengxiao_text).
-compile(export_all).

get_email_text(Type) ->
    case Type of
		0 ->
			"生肖大奖奖励";
        1 ->
            "您获得生肖大奖特等奖，奖励如下，请查收：\n元宝";
        2 ->
            "\n绑定元宝";
        3 ->
            "\n绑定铜币";
        4 ->
            "您获得生肖大奖一等奖，奖励如下，请查收：\n绑定元宝";
        5 ->
            "您获得生肖大奖二等奖，奖励如下，请查收：\n绑定元宝";
        6 ->
            "您获得生肖大奖三等奖，奖励如下，请查收：\n绑定铜币";
        7 ->
            "您获得生肖大奖参与奖，奖励如下，请查收：\n绑定铜币"
    end.

get_award_text(Type) ->
	case Type of
		0 ->
			"成功领取特等奖";
		1 ->
			"成功领取一等奖";
		2 ->
			"成功领取二等奖";
		3 ->
			"成功领取三等奖";
		4 -> 
			"成功领取参与奖"
	end.
