%%%-----------------------------------
%%% @Module  : data_task_text
%%% @Author  : zhenghehe
%%% @Created : 2011.06.14
%%% @Description: 中文文本
%%%-----------------------------------
-module(data_task_text).
-compile(export_all).

get_receive_exp_gold() ->
    ["元宝领取任务累积经验"].

get_task_proxy_action(Type) ->
    case Type of
        1 ->
            <<"你还没选择委托的任务">>;
        2 ->
            <<"委托的任务失败!">>
    end.

get_task_proxy_action_check(Type) ->
    case Type of
        1 ->
            <<"数据异常，该任务无法委托">>;
        2 ->
            <<"该任务正在委托中，无法再委托">>;
        3 ->
            <<"该类型任务无法委托">>;
        4 ->
            "任务【~s】超过今天上限，无法委托";
        5 ->
            <<"你的元宝不足，无法委托任务">>
    end.

get_once_finish_check(Type) ->
    case Type of
        1 ->
            <<"立即完成失败">>;
        2 ->
            <<"您的元宝不足！">>
    end.

get_mon_name() ->
    <<"千年古墓">>.

get_can_trigger_msg(Type) ->
    case Type of
        1 ->
            <<"已经触发过了">>;
        2 ->
            <<"没有这个任务">>;
        3 ->
            <<"等级不足或等级不符合">>;
        4 ->
            <<"还没有帮会，不能接帮会任务">>;
        5 ->
            <<"阵营不符合">>;
        6 ->
            <<"职业不符合">>;
        7 ->
            <<"前置任务未完成">>;
        8 ->
            <<"不能重复接受">>;
        9 ->
            <<"条件不足">>
    end.

get_normal_trigger(Type) ->
    case Type of
        1 ->
            <<"等级不足！">>;
        2 ->
            <<"诛妖帖每天只能领取5次">>;
        3 ->
            <<"运镖任务出错">>;
        4 ->
            <<"您不够钱交纳保证金">>;
        5 ->
            <<"坐骑上不能护送">>;
        6 ->
            <<"切换PK状态失败">>;
        7 ->
            <<"你需在长安才能接取此任务">>;
        8 ->
            <<"背包空间不足，无法卸下坐骑">>;
        9 ->
            <<"护送任务每天只能接受3次">>;
        10 ->
            <<"体力不足">>;
		11 ->
			<<"场景切换中,无法接取护送任务">>;
		12 ->
			<<"皇榜任务每天只能领取20次">>;
		13 ->
			<<"平乱任务每天只能领取10次">>
    end.

get_award_msg() ->
    <<"奖励：">>.
get_award_msg(Type) ->
    case Type of
        1 ->
            <<"经验">>;
        2 ->
            <<"铜钱">>;
        3 ->
            <<"绑定铜">>;
        4 ->
            <<"灵力">>;
        5 ->
            <<"古墓积分">>;
        6 ->
            <<"历练声望">>;
        7 ->
            <<"修为声望">>;
        8 ->
            <<"副本声望">>;
        9 ->
            <<"帮派声望">>;
        10 ->
            <<"国家声望">>;
        11 ->
            <<"物品">>
    end.

get_auto_finish(Type) ->
    case Type of
        1 ->
            <<"尚未接受相关任务！">>;
        2 ->
            <<"任务已完成，无需再使用该物品！">>
    end.

get_choose_country() ->
    <<"请先选择国家！">>.

get_text(Type) ->
    case Type of
        1 ->
            <<"技能名称">>;
        2 ->
            <<"任务未完成！">>;
        3 ->
            <<"背包空间不足！">>;
        4 ->
            <<"没有回收物品！">>;
        5 ->
            <<"铜币不足！">>;
        6 ->
            <<"您今天的帮贡已到达上限，无法完成任务！">>;
        7 ->
            <<"帮会贡献">>;
        8 ->
            <<"帮会经验">>;
        _ ->
            <<" ">>
    end.

task_er_award_email(Type) ->
    if
        Type =:= 10 ->
            Title = "平乱任务奖励",
            Content = "亲爱的仙友，由于您的背包格子不足，我们把平乱任务的奖励礼包通过邮件发送给您，请查收！",
            [Title, Content];
        Type =:= 20 ->
            Title = "平乱任务奖励",
            Content = "亲爱的仙友，由于您的背包格子不足，我们把平乱任务的奖励礼包通过邮件发送给您，请查收！",
            [Title, Content];
        true ->
            skip
    end.