%%%---------------------------------------
%%% @Module  : data_appointment_dungeon
%%% @Author  : zzm
%%% @Email   : ming_up@163.com
%%% @Created : 2011-09-24
%%% @Description:  情缘副本怪物名字配置
%%%--------------------------------------

-module(data_appointment_dungeon).
-export([get_name/0]).

get_name() -> 
    [{<<"衣带渐宽终不悔">>, <<"为伊消得人憔悴">>},
        {<<"死生契阔">>, <<"与子成说">>},
        {<<"执子之手">>, <<"与子偕老">>},
        {<<"两情若是久长时">>, <<"又岂在朝朝暮暮">>},
        {<<"相思相见知何曰">>, <<"此时此夜难为情">>},
        {<<"入我相思门">>, <<"知我相思苦">>},
        {<<"长相思兮长相忆">>, <<"短相思兮无穷极">>},
        {<<"曾经沧海难为水">>, <<"除却巫山不是云">>},
        {<<"还君明珠双泪垂">>, <<"恨不相逢未嫁时">>},
        {<<"落红不是无情物">>, <<"化作春泥更护花">>},
        {<<"此情可待成追忆">>, <<"只是当时已惘然">>},
        {<<"身无彩凤双飞翼">>, <<"心有灵犀一点通">>},
        {<<"天长地久有时尽">>, <<"此恨绵绵无绝期">>},
        {<<"在天愿作比翼鸟">>, <<"在地愿为连理枝">>},
        {<<"春蚕到死丝方尽">>, <<"蜡炬成灰泪始乾">>},
        {<<"他生莫作有情痴">>, <<"人间无地著相思">>},
        {<<"窈宨淑女">>, <<"君子好逑">>},
        {<<"蒹葭苍苍">>, <<"白露为霜">>},
        {<<"人生自是有情痴">>, <<"此恨不关风与月">>},
        {<<"落花人独立">>, <<"微雨燕双飞">>},
        {<<"可怜无定河边骨">>, <<"犹是春闺梦裏人">>},
        {<<"鱼沈雁杳天涯路">>, <<"始信人间别离苦">>},
        {<<"诚知此恨人人有">>, <<"贫贱夫妻百事哀">>},
        {<<"忆君心似西江水">>, <<"曰夜东流无歇时">>},
        {<<"春心莫共花争发">>, <<"一寸相思一寸灰">>},
        {<<"相思似海深">>, <<"旧事如天远">>},
        {<<"相恨不如潮有信">>, <<"相思始觉海非深">>},
        {<<"天涯地角有穷时">>, <<"只有相思无尽处">>},
        {<<"人如风後入江云">>, <<"情似雨馀黏地絮">>},
        {<<"泪眼问花花不语">>, <<"乱红飞过秋千去">>},
        {<<"瘦影自怜秋水照">>, <<"卿须怜我我怜卿">>},
        {<<"多情只有春庭月">>, <<"犹为离人照落花">>},
        {<<"花红易衰似郎意">>, <<"水流无限似侬愁">>},
        {<<"若有知音见采">>, <<"不辞遍唱阳春">>},
        {<<"思君如明烛">>, <<"煎心且衔泪">>},
        {<<"生当复来归">>, <<"死当长相思">>},
        {<<"休言半纸无多重">>, <<"万斛离愁尽耐担">>},
        {<<"妾似胥山长在眼">>, <<"郎如石佛本无心">>},
        {<<"同心而离居">>, <<"忧伤以终老">>},
        {<<"夜月一帘幽梦">>, <<"春风十里柔情">>},
        {<<"无情不似多情苦">>, <<"一寸还成千万缕">>},
        {<<"唯将终夜长开眼">>, <<"报答平生未展眉">>},
        {<<"别来半岁音书绝">>, <<"一寸离肠千万结">>},
        {<<"相思一夜梅花发">>, <<"忽到窗前疑是君">>},
        {<<"此水几时休">>, <<"此恨何时已">>},
        {<<"相思本是无凭语">>, <<"莫向花牋费泪行">>},
        {<<"离愁渐远渐无穷">>, <<"迢迢不断如春水">>},
        {<<"若教眼底无离恨">>, <<"不信人间有白头">>},
        {<<"还卿一钵无情泪">>, <<"恨不相逢未剃时">>},
        {<<"欲寄彩笺兼尺素">>, <<"山长水阔知何处">>}].    