%%------------------------------------------------------------------------------
%%% @Module  : data_king_dun_config
%%% @Author  : liangjianxiong
%%% @Email   : ljianxiong@qq.com
%%% @Created : 2012.11.20
%%% @Description: 皇家守卫军塔防副本配置
%%------------------------------------------------------------------------------


-module(data_king_dun_config).
-include("king_dun.hrl").


%% 公共函数：外部模块调用.
-export([
		 get_config/1,              %% 得到副本基本配置.
         get_building_data/1,       %% 得到建筑物数据.
         get_building_last_level/1, %% 得到建筑升级前的ID.
         get_building_score/1,      %% 得到建筑的积分.
         get_building_position/1,   %% 得到建筑的坐标.
         get_soldier_position/2,    %% 得到士兵的坐标.
         get_skill/1,               %% 得到技能数据.
         get_level/1                %% 得到怪物的波数.
]).

%% 得到副本基本配置.
get_config(Type)->
	case Type of
		%1.龙儿id.
		princess_id -> 35000;
		
		%2.跳层开放的等级.
		open_level_list -> [1, 10, 20, 30, 40, 50];
		
		%3.被动挂机的建筑ID.
		passive_building_list -> [35002, 35003, 35004, 35005, 36000];
		
		%4.创建的建筑列表.
		create_building_list -> [{1, 36000}, {2, 35002}, {3, 36000}, {4, 36000}, {5, 35002}, {6, 36000}];
		
		%5.敌对怪物挂机对象[移动地点X，移动地点Y，[我方怪物]].
		ai_mon_list -> [18, 25, [35001, %% 援兵.
							     35006,  %% 天兵.
								 35007,  %% 天将.
								 35008,  %% 厚甲天将.
								 35009,  %% 狂暴天将.
								 35018,  %% 天将1级.
								 35019,  %% 天将2级.
								 35020,  %% 天将3级.
								 0,       %% 玩家.
								 35000   %% 龙儿.
								 ]];
		
		%6.没有定义.
		_-> undefined
	end.

%% 得到建筑物数据.
get_building_data(BuildingId) ->
    case BuildingId of
        %1.兵营1.
        35002 -> #king_dun_building{mid = 35002, skill_list = [],
                soldier_list = [{king_dun_soldier,0,35006},{king_dun_soldier,0,35006},{king_dun_soldier,0,35006}]};
		
        %2.兵营2.
        35003 -> #king_dun_building{mid = 35003, skill_list = [],
                soldier_list = [{king_dun_soldier,0,35007},{king_dun_soldier,0,35007},{king_dun_soldier,0,35007}]};
		
        %3.兵营3-厚甲守卫.
        35004 -> #king_dun_building{mid = 35004, skill_list = [{901043,0},{901031,0},{901034,0}],
                soldier_list = [{king_dun_soldier,0,35008},{king_dun_soldier,0,35008},{king_dun_soldier,0,35008}]};
		
        %4.兵营4-狂暴士兵.
        35005 -> #king_dun_building{mid = 35005, skill_list = [{901045,0},{901037,0},{901040,0}],
                soldier_list = [{king_dun_soldier,0,35009},{king_dun_soldier,0,35009},{king_dun_soldier,0,35009}]};
		
        %5.箭塔1.
        35010 -> #king_dun_building{mid = 35010, skill_list = [], soldier_list = []};
		
        %6.箭塔2.
        35011 -> #king_dun_building{mid = 35011, skill_list = [], soldier_list = []};
		
        %7.箭塔3-短弓塔.
        35012 -> #king_dun_building{mid = 35012, skill_list = [{901001,0},{901004,0},{901007,0}], soldier_list = []};
		
        %8.箭塔4-长弓塔.
        35013 -> #king_dun_building{mid = 35013, skill_list = [{901010,0},{901013,0}], soldier_list = []};
		
        %9.魔法塔1.
        35014 -> #king_dun_building{mid = 35014, skill_list = [], soldier_list = []};
		
        %10.魔法塔2.
        35015 -> #king_dun_building{mid = 35015, skill_list = [], soldier_list = []};
		
        %11.魔法塔3-神圣塔.
        35016 -> #king_dun_building{mid = 35016, skill_list = [{901016,0},{901019,0},{901022,0}], soldier_list = []};
		
        %12.魔法塔4-天谴塔.
        35017 -> #king_dun_building{mid = 35017, skill_list = [{901025,0},{901028,0}], soldier_list = []};
		
        %13.建造标.
        36000 -> #king_dun_building{mid = 36000, skill_list = [], soldier_list = []};
		
        %14.找不到建筑物.
        _BuildingId -> #king_dun_building{mid = 0}
    end.

%% 得到建筑升级前的ID.
get_building_last_level(BuildingId) ->
	case BuildingId of
		%35001 -> 36000;%兵营1.
		35003 -> 35002;%兵营2.
		35004 -> 35003;%兵营3.
		35005 -> 35003;%兵营4.
		35010 -> 36000;%箭塔1.
		35011 -> 35010;%箭塔2.
		35012 -> 35011;%箭塔3-短弓塔.
		35013 -> 35011;%箭塔4-长弓塔.
		35014 -> 36000;%魔法塔1.
		35015 -> 35014;%魔法塔2.
		35016 -> 35015;%魔法塔3-神圣塔.
		35017 -> 35015;%魔法塔4-天谴塔.
		_     ->  0
	end.

%% 得到升级建筑的积分.
get_building_score(BuildingId) ->
	case BuildingId of
		35002 -> 100;%兵营1.
		35003 -> 100;%兵营2.
		35004 -> 200;%兵营3.
		35005 -> 200;%兵营4.
		35010 -> 100;%箭塔1.
		35011 -> 100;%箭塔2.
		35012 -> 200;%箭塔3.
		35013 -> 200;%箭塔4.
		35014 -> 100;%魔法1.
		35015 -> 100;%魔法2.
		35016 -> 200;%魔法3.
		35017 -> 200;%魔法4.
		_     ->  0
	end.

%% 得到建筑的坐标.
get_building_position(Position) ->
	case Position of
		1 -> {23, 28};%21.
		2 -> {27, 32};%兵营1.
		3 -> {30, 35};%22.
		4 -> {13, 38};%11.
		5 -> {17, 42};%兵营1.
		6 -> {20, 45};%12.		
		_ -> {0, 0}
	end.

%% 得到士兵的坐标.
%% PositionData = {第几个建筑物，第几个士兵}.
get_soldier_position(Position, Count) ->
	PositionData = {Position, Count},
	case PositionData of
		{2,1} -> {25, 32};
		{2,2} -> {27, 35};
		{2,3} -> {25, 34};
		{5,1} -> {19, 37};
		{5,2} -> {20, 40};
		{5,3} -> {21, 37};
		_ -> {0, 0}
	end.

%% 得到技能数据.
%% {假技能ID,等级} -{真技能ID，概率，升级积分}.
get_skill(SkillIndex) ->
	case SkillIndex of
		{901001, 1} -> {901001, 100, 130}; %短弓塔-毒性攻击1级.
		{901001, 2} -> {901002, 100, 130}; %短弓塔-毒性攻击2级.
		{901001, 3} -> {901003, 100, 130}; %短弓塔-毒性攻击3级.
		{901004, 1} -> {901004, 100, 130}; %短弓塔-群攻1级.
		{901004, 2} -> {901005, 100, 130}; %短弓塔-群攻2级.
		{901004, 3} -> {901006, 100, 130}; %短弓塔-群攻3级.
		{901007, 1} -> {901007, 100, 130}; %短弓塔-暴击1级.
		{901007, 2} -> {901008, 100, 130}; %短弓塔-暴击2级.
		{901007, 3} -> {901009, 100, 130}; %短弓塔-暴击3级.	
		{901010, 1} -> {901010, 100, 200}; %长弓塔-爆头1级.
		{901010, 2} -> {901011, 100, 200}; %长弓塔-爆头2级.
		{901010, 3} -> {901012, 100, 200}; %长弓塔-爆头3级.
		{901013, 1} -> {901013, 100, 200}; %长弓塔-缠绕1级.
		{901013, 2} -> {901014, 100, 200}; %长弓塔-缠绕2级.
		{901013, 3} -> {901015, 100, 200}; %长弓塔-缠绕3级.	
		{901016, 1} -> {901016, 100, 130}; %神圣塔-诅咒1级.
		{901016, 2} -> {901017, 100, 130}; %神圣塔-诅咒2级.
		{901016, 3} -> {901018, 100, 130}; %神圣塔-诅咒3级.
		{901019, 1} -> {call_mon, 35018, 130}; %神圣塔-召唤1级.
		{901019, 2} -> {call_mon, 35019, 130}; %神圣塔-召唤2级.
		{901019, 3} -> {call_mon, 35020, 130}; %神圣塔-召唤3级.
		{901022, 1} -> {901022, 100, 130}; %神圣塔-变羊1级.
		{901022, 2} -> {901023, 100, 130}; %神圣塔-变羊2级.
		{901022, 3} -> {901024, 100, 130}; %神圣塔-变羊3级.	
		{901025, 1} -> {901025, 100, 100}; %天谴塔-传送1级.
		{901025, 2} -> {901026, 100, 100}; %天谴塔-传送2级.
		{901025, 3} -> {901027, 100, 100}; %天谴塔-传送3级.
		{901028, 1} -> {901028, 100, 300}; %天谴塔-灭杀1级.
		{901028, 2} -> {901029, 100, 300}; %天谴塔-灭杀2级.
		{901028, 3} -> {901030, 100, 300}; %天谴塔-灭杀3级.	
		{901043, 1} -> {hp_lim, 3200, 180}; %厚甲守卫-勇气之盾1级.
		{901043, 2} -> {hp_lim, 6400, 180}; %厚甲守卫-勇气之盾2级.
		{901043, 3} -> {hp_lim, 10000, 180}; %厚甲守卫-勇气之盾3级.
		{901031, 1} -> {901031, 100, 180}; %厚甲守卫-治疗之光1级.
		{901031, 2} -> {901032, 100, 180}; %厚甲守卫-治疗之光2级.
		{901031, 3} -> {901033, 100, 180}; %厚甲守卫-治疗之光3级.
		{901034, 1} -> {901034, 100, 140}; %厚甲守卫-神圣打击1级.
		{901034, 2} -> {901035, 100, 140}; %厚甲守卫-神圣打击2级.
		{901034, 3} -> {901036, 100, 140}; %厚甲守卫-神圣打击3级.	
		{901045, 1} -> {att, 80, 180}; %狂暴士兵-投掷攻击1级.
		{901045, 2} -> {att, 80, 180}; %狂暴士兵-投掷攻击2级.
		{901045, 3} -> {att, 90, 180}; %狂暴士兵-投掷攻击3级.
		{901037, 1} -> {901037, 100, 140}; %狂暴士兵-击晕1级.
		{901037, 2} -> {901038, 100, 140}; %狂暴士兵-击晕2级.
		{901037, 3} -> {901039, 100, 140}; %狂暴士兵-击晕3级.
		{901040, 1} -> {901040, 100, 180}; %狂暴士兵-加攻1级.
		{901040, 2} -> {901041, 100, 180}; %狂暴士兵-加攻2级.
		{901040, 3} -> {901042, 100, 180}; %狂暴士兵-加攻3级.
		_           -> {0,      0,   0}
	end.

%% 得到怪物的波数.
get_level(MonId) ->
	case MonId of
		35105 -> 5;
		35110 -> 10;
		35115 -> 15;
		35120 -> 20;
		35125 -> 25;
		35130 -> 30;
		35135 -> 35;
		35140 -> 40;
		35145 -> 45;
		35150 -> 50;
		_ -> 0
	end.