%%------------------------------------------------------------------------------
%%% @Module  : data_multi_king_dun_config
%%% @Author  : liangjianxiong
%%% @Email   : ljianxiong@qq.com
%%% @Created : 2012.11.21
%%% @Description: 多人皇家守卫军塔防副本配置
%%------------------------------------------------------------------------------


-module(data_multi_king_dun_config).
-include("king_dun.hrl").


%% 公共函数：外部模块调用.
-export([
		 get_config/1,              %% 得到副本基本配置.
         get_building_data/1,       %% 得到建筑物数据.
         get_building_last_level/1, %% 得到建筑升级前的ID.
         get_building_score/1,      %% 得到建筑的积分.
         get_building_position/1,   %% 得到建筑的坐标.
         get_soldier_position/2,    %% 得到士兵的坐标.
         get_skill/1,               %% 得到技能数据.
         get_skill_name/1           %% 得到技能名字
]).

%% 得到副本基本配置.
get_config(Type)->
	case Type of
		%1.龙儿id.
		princess_id -> 36999;
		
		%2.跳层开放的等级.
		open_level_list -> [1, 10, 20, 30, 40, 50];
		
		%3.被动挂机的建筑ID.
		passive_building_list -> [36002, 36003, 36004, 36005, 37000];
		
		%4.创建的建筑列表.
		create_building_list -> [{1, 37000}, {2, 36002}, {3, 37000}, {4, 37000}, {5, 36002}, {6, 37000}];
		
		%5.敌对怪物挂机对象[移动地点X，移动地点Y，[我方怪物]].
		ai_mon_list -> [18, 25, [36001, %% 援兵.
							     36006,  %% 天兵.
								 36007,  %% 天将.
								 36008,  %% 厚甲天将.
								 36009,  %% 狂暴天将.
								 36018,  %% 天将1级.
								 36019,  %% 天将2级.
								 36020,  %% 天将3级.
								 0,       %% 玩家.
								 36999   %% 龙儿.
								 ]];
		
		%6.没有定义.
		_-> undefined
	end.

%% 得到建筑物数据.
get_building_data(BuildingId) ->
    case BuildingId of
        %1.兵营1.
        36002 -> #king_dun_building{mid = 36002, skill_list = [],
                soldier_list = [{king_dun_soldier,0,36006},{king_dun_soldier,0,36006},{king_dun_soldier,0,36006}]};
		
        %2.兵营2.
        36003 -> #king_dun_building{mid = 36003, skill_list = [],
                soldier_list = [{king_dun_soldier,0,36007},{king_dun_soldier,0,36007},{king_dun_soldier,0,36007}]};
		
        %3.兵营3-厚甲守卫.
        36004 -> #king_dun_building{mid = 36004, skill_list = [{902043,0},{902031,0},{902034,0}],
                soldier_list = [{king_dun_soldier,0,36008},{king_dun_soldier,0,36008},{king_dun_soldier,0,36008}]};
		
        %4.兵营4-狂暴士兵.
        36005 -> #king_dun_building{mid = 36005, skill_list = [{902045,0},{902037,0},{902040,0}],
                soldier_list = [{king_dun_soldier,0,36009},{king_dun_soldier,0,36009},{king_dun_soldier,0,36009}]};
		
        %5.箭塔1.
        36010 -> #king_dun_building{mid = 36010, skill_list = [], soldier_list = []};
		
        %6.箭塔2.
        36011 -> #king_dun_building{mid = 36011, skill_list = [], soldier_list = []};
		
        %7.箭塔3-短弓塔.
        36012 -> #king_dun_building{mid = 36012, skill_list = [{902001,0},{902004,0},{902007,0}], soldier_list = []};
		
        %8.箭塔4-长弓塔.
        36013 -> #king_dun_building{mid = 36013, skill_list = [{902010,0},{902013,0}], soldier_list = []};
		
        %9.魔法塔1.
        36014 -> #king_dun_building{mid = 36014, skill_list = [], soldier_list = []};
		
        %10.魔法塔2.
        36015 -> #king_dun_building{mid = 36015, skill_list = [], soldier_list = []};
		
        %11.魔法塔3-神圣塔.
        36016 -> #king_dun_building{mid = 36016, skill_list = [{902016,0},{902019,0},{902022,0}], soldier_list = []};
		
        %12.魔法塔4-天谴塔.
        36017 -> #king_dun_building{mid = 36017, skill_list = [{902025,0},{902028,0}], soldier_list = []};
		
        %13.建造标.
        37000 -> #king_dun_building{mid = 37000, skill_list = [], soldier_list = []};
		
        %14.找不到建筑物.
        _BuildingId -> #king_dun_building{mid = 0}
    end.

%% 得到建筑升级前的ID.
get_building_last_level(BuildingId) ->
	case BuildingId of
		%36001 -> 37000;%兵营1.
		36003 -> 36002;%兵营2.
		36004 -> 36003;%兵营3.
		36005 -> 36003;%兵营4.
		36010 -> 37000;%箭塔1.
		36011 -> 36010;%箭塔2.
		36012 -> 36011;%箭塔3-短弓塔.
		36013 -> 36011;%箭塔4-长弓塔.
		36014 -> 37000;%魔法塔1.
		36015 -> 36014;%魔法塔2.
		36016 -> 36015;%魔法塔3-神圣塔.
		36017 -> 36015;%魔法塔4-天谴塔.
		_     ->  0
	end.

%% 得到升级建筑的积分.
get_building_score(BuildingId) ->
	case BuildingId of
		36002 -> 100;%兵营1.
		36003 -> 100;%兵营2.
		36004 -> 200;%兵营3.
		36005 -> 200;%兵营4.
		36010 -> 100;%箭塔1.
		36011 -> 100;%箭塔2.
		36012 -> 200;%箭塔3.
		36013 -> 200;%箭塔4.
		36014 -> 100;%魔法1.
		36015 -> 100;%魔法2.
		36016 -> 200;%魔法3.
		36017 -> 200;%魔法4.
		_     ->  0
	end.

%% 得到建筑的坐标.
get_building_position(Position) ->
	case Position of
		1 -> {23, 28};%21.
		2 -> {27, 32};%兵营1.
		3 -> {30, 35};%22.	
		4 -> {13, 38};%11.
		5 -> {17, 42};%兵营1.
		6 -> {20, 45};%12.
		_ -> {0, 0}
	end.

%% 得到士兵的坐标.
%% PositionData = {第几个建筑物，第几个士兵}.
get_soldier_position(Position, Count) ->
	PositionData = {Position, Count},
	case PositionData of
		{2,1} -> {25, 32};
		{2,2} -> {27, 35};
		{2,3} -> {25, 34};
		{5,1} -> {19, 37};
		{5,2} -> {20, 40};
		{5,3} -> {21, 37};
		_ -> {0, 0}
	end.

%% 得到技能数据.
%% {假技能ID,等级} -{真技能ID，概率，升级积分}.
get_skill(SkillIndex) ->
	case SkillIndex of
		{902001, 1} -> {902001, 100, 130}; %短弓塔-毒性攻击1级.
		{902001, 2} -> {902002, 100, 130}; %短弓塔-毒性攻击2级.
		{902001, 3} -> {902003, 100, 130}; %短弓塔-毒性攻击3级.
		{902004, 1} -> {902004, 100, 130}; %短弓塔-群攻1级.
		{902004, 2} -> {902005, 100, 130}; %短弓塔-群攻2级.
		{902004, 3} -> {902006, 100, 130}; %短弓塔-群攻3级.
		{902007, 1} -> {902007, 100, 130}; %短弓塔-暴击1级.
		{902007, 2} -> {902008, 100, 130}; %短弓塔-暴击2级.
		{902007, 3} -> {902009, 100, 130}; %短弓塔-暴击3级.	
		{902010, 1} -> {902010, 100, 200}; %长弓塔-爆头1级.
		{902010, 2} -> {902011, 100, 200}; %长弓塔-爆头2级.
		{902010, 3} -> {902012, 100, 200}; %长弓塔-爆头3级.
		{902013, 1} -> {902013, 100, 200}; %长弓塔-缠绕1级.
		{902013, 2} -> {902014, 100, 200}; %长弓塔-缠绕2级.
		{902013, 3} -> {902015, 100, 200}; %长弓塔-缠绕3级.	
		{902016, 1} -> {902016, 100, 130}; %神圣塔-诅咒1级.
		{902016, 2} -> {902017, 100, 130}; %神圣塔-诅咒2级.
		{902016, 3} -> {902018, 100, 130}; %神圣塔-诅咒3级.
		{902019, 1} -> {call_mon, 36018, 130}; %神圣塔-召唤1级.
		{902019, 2} -> {call_mon, 36019, 130}; %神圣塔-召唤2级.
		{902019, 3} -> {call_mon, 36020, 130}; %神圣塔-召唤3级.
		{902022, 1} -> {902022, 100, 130}; %神圣塔-变羊1级.
		{902022, 2} -> {902023, 100, 130}; %神圣塔-变羊2级.
		{902022, 3} -> {902024, 100, 130}; %神圣塔-变羊3级.	
		{902025, 1} -> {902025, 100, 100}; %天谴塔-传送1级.
		{902025, 2} -> {902026, 100, 100}; %天谴塔-传送2级.
		{902025, 3} -> {902027, 100, 100}; %天谴塔-传送3级.
		{902028, 1} -> {902028, 100, 300}; %天谴塔-灭杀1级.
		{902028, 2} -> {902029, 100, 300}; %天谴塔-灭杀2级.
		{902028, 3} -> {902030, 100, 300}; %天谴塔-灭杀3级.	
		{902043, 1} -> {hp_lim, 3750, 180}; %厚甲守卫-勇气之盾1级.
		{902043, 2} -> {hp_lim, 7500, 180}; %厚甲守卫-勇气之盾2级.
		{902043, 3} -> {hp_lim, 11800, 180}; %厚甲守卫-勇气之盾3级.
		{902031, 1} -> {902031, 100, 180}; %厚甲守卫-治疗之光1级.
		{902031, 2} -> {902032, 100, 180}; %厚甲守卫-治疗之光2级.
		{902031, 3} -> {902033, 100, 180}; %厚甲守卫-治疗之光3级.
		{902034, 1} -> {902034, 100, 140}; %厚甲守卫-神圣打击1级.
		{902034, 2} -> {902035, 100, 140}; %厚甲守卫-神圣打击2级.
		{902034, 3} -> {902036, 100, 140}; %厚甲守卫-神圣打击3级.	
		{902045, 1} -> {att, 136, 180}; %狂暴士兵-投掷攻击1级.
		{902045, 2} -> {att, 272, 180}; %狂暴士兵-投掷攻击2级.
		{902045, 3} -> {att, 425, 180}; %狂暴士兵-投掷攻击3级.
		{902037, 1} -> {902037, 100, 140}; %狂暴士兵-击晕1级.
		{902037, 2} -> {902038, 100, 140}; %狂暴士兵-击晕2级.
		{902037, 3} -> {902039, 100, 140}; %狂暴士兵-击晕3级.
		{902040, 1} -> {902040, 100, 180}; %狂暴士兵-加攻1级.
		{902040, 2} -> {902041, 100, 180}; %狂暴士兵-加攻2级.
		{902040, 3} -> {902042, 100, 180}; %狂暴士兵-加攻3级.
		_           -> {0,      0,   0}
	end.

%% 得到技能名字
get_skill_name(SkillId) ->
	case SkillId of
		902001 -> <<"毒龙蚀">>;
		902004 -> <<"群攻">>;
		902007 -> <<"天狼破">>;
		902010 -> <<"真元华闪">>;
		902013 -> <<"缠魂击">>;
		902016 -> <<"封魔咒">>;
		902019 -> <<"神兵降临">>;
		902022 -> <<"归真诀">>;
		902025 -> <<"空灵闪">>;
		902028 -> <<"灭杀">>;
		902043 -> <<"天神护体">>;
		902031 -> <<"佛光普照">>;
		902034 -> <<"震天斩">>;
		902045 -> <<"凤鸣矢">>;
		902037 -> <<"星芒击">>;
		902040 -> <<"狂暴">>;
		_       -> <<"技能">>
	end.