%%%---------------------------------------
%%% @Module  : data_image
%%% @Author  : hekai 
%%% @Created : 
%%% @Description:  玩家头像配置
%%%---------------------------------------
-module(data_image).
-compile(export_all).

%% 其它配置
image_config(Type) ->
	if
		Type=:= dialy_num ->
			3;
		Type=:= refresh_cd ->
			120;
		Type=:= image_goods_id ->
			522007;
		true ->
			skip
	end.

%% 所有头像
all_image(ImageType) ->
	if  %%普通头像 
		ImageType =:= 1 ->
			[0, 1, 2, 3, 4, 11];
		%% 特殊头像
		ImageType =:= 2 ->
			[38, 37, 36, 35, 34, 33, 32, 31, 30];
		%% 仙侣头像
		ImageType =:= 3 ->
			[81, 82, 83, 84, 85, 86]
	end.

%% 普通头像配置
%% @Lv 玩家等级
normal_image_config(Lv) ->
	if
		Lv<40 -> %% Id后面的1激活、0未激活
			[{0, 1},{1, 0},{2, 0},{3, 0},{4, 0},{11,0}];
		Lv<50 ->
			[{0, 1},{1, 1},{2, 0},{3, 0},{4, 0},{11,0}];
		true ->
			[{0, 1},{1, 1},{2, 1},{3, 1},{4, 1},{11,1}]
	end.

%% 仙侣头像配置
%% @Lv 仙缘修炼类别10等级
%% [{31, 0},{32, 0},{33, 0},{34, 0},{35, 0}]
xianlv_image_config(Lv) ->
	if
		%% Id后面的1激活、0未激活	
		Lv>=30 ->
			[{81, 1},{82, 1},{83,1},{84,1},{85,1},{86,1}];
		Lv>=20 ->
			[{81, 1},{82, 1},{83,1},{84,1},{85,0},{86,0}];
		Lv>=15 ->
			[{81, 1},{82, 1},{83,1},{84,0},{85,0},{86,0}];
		Lv>=10 ->
			[{81, 1},{82, 1},{83,0},{84,0},{85,0},{86,0}];
		Lv>=1 ->
			[{81, 1},{82, 0},{83,0},{84,0},{85,0},{86,0}];
		true ->
			[{81, 0},{82, 0},{83,0},{84,0},{85,0},{86,0}]
	end.
