%%%-------------------------------------------------------------------
%%% @Module	: qixi
%%% @Author	: liangjianzhao
%%% @Email	: 298053832@qq.com
%%% @Created	: 21 Aug 2012
%%% @Description: 
%%%-------------------------------------------------------------------
%%关系列表
-record(ets_qixi_activity, 
	{
	  id = 0,	    %玩家id
	  hs = 0,	    %护送美女
	  pl = 0,	    %平乱
	  hb = 0,	    %皇榜
	  zyt = 0,          %诛妖贴
	  bpsl = 0,	    %帮派试炼
	  xlqy = 0,          %仙侣奇缘
	  g1 = 0,
	  g2 = 0,
	  g3 = 0,
	  g4 = 0,
	  g5 = 0,
	  g6 = 0,
	  
	  t1 = 0,	    %宠物成长提升
	  t2 = 0,	    %宠物潜能修行
	  t3 = 0,	    %装备副本多人
	  t4 = 0,           %装备副本单人
	  t5 = 0,	    %淘宝
	  t6 = 0,	    %洗炼
	  g7 = 0,
	  g8 = 0,
	  g9 = 0,
	  g10 = 0,
	  g11 = 0,
	  g12 = 0
	}
       ).


